Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignCode.MaterialType Property
 Gets the material type of the analysis analysis design code.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisMaterial.MaterialTypeEnum MaterialType { get; }
Public ReadOnly Property MaterialType As AnalysisMaterial.MaterialTypeEnum
	Get
Property Value
Type: AnalysisMaterial.MaterialTypeEnum
See Also
Reference
AnalysisDesignCode Class
Tekla.Structures.Analysis Namespace